src/Catalogs/ПрайсЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПрайсЛист</Name>
			<Comment>Прайс-лист товаров</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыПрайсЛистов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Элемент номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/АлгоритмПолученияЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АлгоритмПолученияЦены</Name>
			<Comment>Алгоритм получения цены для данного типа цен. Задает список полей (аналитик), в разрезе которых происходит получение и установка цен.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
					<Comment>Получать цену только для номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоХарактеристике</Name>
					<Comment>Получать цену в разрезе характеристик. Если для характеристики цена не задана, то получается цена для номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницеИзмерения</Name>
					<Comment>Получать цену в разрезе единиц измерения. Если для единицы измерения цена не задана, то получается цена для номенклатуры</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Comment>Дополнительные характеристики номенклатуры</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.ТипыНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Comment>Дата изготовления серии номенклатуры</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Comment>Срок годности</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>Серийный номер номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категория качества номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>Порядковый номер характеристики, по которому производиться сортировка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСахара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Негоциант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Comment>Полный текст строкового дополнительного реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Справки2ЕГАИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПрайсЛист/Forms/ФормаВыгрузки/Ext/Form/Module.bsl
#Область ОбработчикиОсновныхСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Параметры.Свойство("ВидПрайсЛиста", ВидПрайсЛиста);
	Если НЕ ЗначениеЗаполнено(ВидПрайсЛиста) Тогда
		ВидПрайсЛиста = Справочники.ВидыПрайсЛистов.ОсновнойВидПрайсЛиста;
	КонецЕсли;
	
	Валюта                = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ОсновнойТипЦенПродажи = ПравоПользователя("ОсновнойТипЦенПродажи");
	ТипЦен                = ОсновнойТипЦенПродажи;
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	СкладКомпании         = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
	КодоваяСтраница       = "windows-1251";
	ФайлИсточникДанных    = Истина;
	СтрокаНачало          = 1;
	
	СтруктураПолейФайла = Новый Структура;
	СтруктураПолейФайла.Вставить("Артикул",                    НСтр("ru = 'Артикул номенклатуры'"));
	СтруктураПолейФайла.Вставить("Наименование",               НСтр("ru = 'Наименование номенклатуры'"));
	СтруктураПолейФайла.Вставить("ЕдиницаИзмерения",           НСтр("ru = 'Единица измерения'"));
	СтруктураПолейФайла.Вставить("ХарактеристикаНоменклатуры", НСтр("ru = 'Характеристика номенклатуры'"));
	СтруктураПолейФайла.Вставить("Цена",                       НСтр("ru = 'Цена номенклатурной позиции'"));
	СтруктураПолейФайла.Вставить("Количество",                 НСтр("ru = 'Количество номенклатуры'"));
	
	НоваяСтрока = ПараметрыПолейДБФ.Добавить();
	НоваяСтрока.Имя      = "Артикул";
	НоваяСтрока.Тип      = "C";
	НоваяСтрока.Длина    = 25;
	НоваяСтрока.Точность = 0;
	НоваяСтрока.ИмяДБФ   = "CodeNum";
	
	НоваяСтрока = ПараметрыПолейДБФ.Добавить();
	НоваяСтрока.Имя      = "Наименование";
	НоваяСтрока.Тип      = "C";
	НоваяСтрока.Длина    = 80;
	НоваяСтрока.Точность = 0;
	НоваяСтрока.ИмяДБФ   = "Name";
	
	НоваяСтрока = ПараметрыПолейДБФ.Добавить();
	НоваяСтрока.Имя      = "ЕдиницаИзмерения";
	НоваяСтрока.Тип      = "C";
	НоваяСтрока.Длина    = 25;
	НоваяСтрока.Точность = 0;
	НоваяСтрока.ИмяДБФ   = "Unit";
	
	НоваяСтрока = ПараметрыПолейДБФ.Добавить();
	НоваяСтрока.Имя      = "ХарактеристикаНоменклатуры";
	НоваяСтрока.Тип      = "C";
	НоваяСтрока.Длина    = 99;
	НоваяСтрока.Точность = 0;
	НоваяСтрока.ИмяДБФ   = "Charact";
	
	НоваяСтрока = ПараметрыПолейДБФ.Добавить();
	НоваяСтрока.Имя      = "Цена";
	НоваяСтрока.Тип      = "N";
	НоваяСтрока.Длина    = 15;
	НоваяСтрока.Точность = 2;
	НоваяСтрока.ИмяДБФ   = "Price";
	
	НоваяСтрока = ПараметрыПолейДБФ.Добавить();
	НоваяСтрока.Имя      = "Количество";
	НоваяСтрока.Тип      = "N";
	НоваяСтрока.Длина    = 15;
	НоваяСтрока.Точность = 3;
	НоваяСтрока.ИмяДБФ   = "Count";
	
	// Заполним таблицу с полями.
	СтруктураФайлаПрайсЛиста.Очистить();
	Для Каждого ПолеФайла Из СтруктураПолейФайла Цикл
		
		НовоеПоле = СтруктураФайлаПрайсЛиста.Добавить();
		НовоеПоле.Использование                        = Истина;
		НовоеПоле.ИмяРеквизитаПрайсЛиста               = ПолеФайла.Ключ;
		НовоеПоле.ИмяРеквизитаСправочникаПредставление = ПолеФайла.Значение; 
	КонецЦикла;
	
	ДоступныеКодировки.Добавить("windows-1251", "CP1251", Истина);
	ДоступныеКодировки.Добавить("cp866",        "CP866",      Истина);
	ДоступныеКодировки.Добавить("UTF-8",        "UTF-8");
	ДоступныеКодировки.Добавить("KOI8-R",       "KOI-8");
	ДоступныеКодировки.Добавить("ISO-8859-5",   "ISO-8859");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПоляВыгрузки();
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипЦенОчистка(Элемент, СтандартнаяОбработка)
	
	ТипЦен = ОсновнойТипЦенПродажи;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлИсточникДанныхПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПодключенияПриИзменении(Элемент)
	
	Если НЕ ФайлИсточникДанных Тогда
		
		Элементы.ИмяТаблицы.СписокВыбора.Очистить();
		ЗаполнитьСпискиВыбораТаблицНачало();
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПодключенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ФайлИсточникДанных Тогда
		
		ВыборФайла();
	Иначе
		
		// Получим строку ADO подключения.
		Connection = Новый COMОбъект("ADODB.Connection");
		// Утилита для формирования и редактирования строки ConnectionString.
		DataLinks  = Новый COMОбъект("DataLinks");
		
		Попытка
			Connection.ConnectionString = СтрокаПодключения;
			// Создадим новый ConnectionString.
			DataLinks.PromptEdit(Connection);
		Исключение
			Connection.ConnectionString = "";
			// Создадим новый ConnectionString.
			DataLinks.PromptEdit(Connection);
		КонецПопытки;
		
		СтрокаПодключения = Connection.ConnectionString;
	КонецЕсли;
	
	СтрокаПодключенияПриИзменении(Элемент);
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПодключенияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ФайлИсточникДанных Тогда
		
		СтрокаЗапуска = СтрокаПодключения;
	Иначе
		
		СтрокаЗапуска = "";
		ЕстьИмяБД     = Ложь;
		МассивСтрок   = РазобратьСтрокуПодключения(СтрокаПодключения);
		
		Для Инд = 0 По МассивСтрок.ВГраница() Цикл
			
			ЗначениеСтроки = МассивСтрок[Инд];
			
			Если СтрНайти(ЗначениеСтроки, "Data Source=") > 0 Тогда
				
				ЗначениеСтроки = СтрЗаменить(ЗначениеСтроки, "Data Source=", "");
				СтрокаЗапуска  = ЗначениеСтроки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		ЗапуститьПриложение(СтрокаЗапуска);
	Исключение
		ВывестиСообщение(НСтр("ru = 'Ошибка открытия файла «%1».'"), , , , , СтрокаЗапуска);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТаблицыПриИзменении(Элемент)
	
	ЗаполнитьПоляВыгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТаблицыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.СписокВыбора.Количество() = 0 Тогда
		ЗаполнитьСпискиВыбораТаблицНачало();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискиВыбораТаблицНачало()
	
	Если ЗначениеЗаполнено(СтрокаПодключения) Тогда
		
		ТекстВопроса        = НСтр("ru = 'Заполнить имена таблицы?'");
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИмяТаблицыНачалоВыбораПродолжение", ЭтотОбъект);
		
		ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСпискиВыбораТаблицНачало()

&НаКлиенте
Процедура ИмяТаблицыНачалоВыбораПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьСпискиВыбораТаблиц();
		ЗаполнитьПоляВыгрузки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаПрайсЛистаИмяПоляФайлаПриИзменении(Элемент)
	
	ТекДанные = Элементы.СтруктураФайлаПрайсЛиста.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ИмяПоляФайла <> Неопределено Тогда
		
		ПараметрыПолей = ПараметрыПолейАДО.НайтиСтроки(Новый Структура("Имя", ТекДанные.ИмяПоляФайла));
		Если ПараметрыПолей.Количество() > 0 Тогда
			
			ТекСтрока = ПараметрыПолей[0];
			
			ТекДанные.ТипПоля      = ТекСтрока.Тип;
			ТекДанные.ДлинаПоля    = ТекСтрока.Длина;
			ТекДанные.ТочностьПоля = ТекСтрока.Точность;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаПрайсЛистаТипПоляПриИзменении(Элемент)
	
	ТекДанные = Элементы.СтруктураФайлаПрайсЛиста.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.ТипПоля <> "N" Тогда
			ТекДанные.ТочностьПоля = 0;
		КонецЕсли;
		
		Если ТекДанные.ТипПоля <> "N" И ТекДанные.ТипПоля <> "C" Тогда
			ТекДанные.ДлинаПоля = 0;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если СтруктураФайлаПрайсЛиста.НайтиСтроки(Новый Структура("Использование", Истина)) = Неопределено Тогда
		
		// Если поля не заполнены продолжать не имеет смысла.
		ВывестиСообщение(НСтр("ru = 'Ни одно поле таблицы не выбрано.'"));
		Возврат;
	КонецЕсли;
	
	Если ФайлИсточникДанных И НЕ ЗначениеЗаполнено(СтрокаПодключения) Тогда
		ВывестиСообщение(НСтр("ru = 'Имя файла прайс-листа пустое.'"));
		Возврат;
	КонецЕсли;
	
	РезультатВыгрузки = Истина;
	
	Если ФайлИсточникДанных Тогда
		
		ТипФайла = "";
		ТипФайла = СокрЛП(СтрокаПодключения);
		
		ПозицияТочки = СтрНайти(ТипФайла, ".");
		Пока ПозицияТочки > 0 Цикл
			
			ТипФайла     = Сред(ТипФайла, ПозицияТочки + 1);
			ПозицияТочки = СтрНайти(ТипФайла, ".");
		КонецЦикла;
		
		ТипФайла = "." + ВРег(ТипФайла);
		
		// Грузим Excel.
		Если ТипФайла = ".XLS" ИЛИ ТипФайла = ".XLSX" Тогда
			
			РезультатВыгрузки = ЗаписатьEXCEL(ТипФайла);
			
		ИначеЕсли ТипФайла = ".TXT" Тогда
			
			РезультатВыгрузки = ЗаписатьTXT();
			
		ИначеЕсли ТипФайла = ".DBF" Тогда
			
			РезультатВыгрузки = ЗаписатьDBF();
		Иначе
			ВывестиСообщение(НСтр("ru = 'Недопустимый тип файла.'"));
			Возврат;
		КонецЕсли;
		
	Иначе
		// Грузим из ADO.
		РезультатВыгрузки = ЗаписатьADO();
	КонецЕсли;
	
	Если РезультатВыгрузки <> Неопределено И РезультатВыгрузки Тогда
	Иначе
		ВывестиСообщение(НСтр("ru = 'Ошибка при выгрузке прайс-листа'"));
		Возврат;
	КонецЕсли;
	
	ВывестиСообщение(НСтр("ru = 'Обработка прайс-листа завершена.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Кнопка)
	
	Префикс = "";
	Если ФайлИсточникДанных Тогда
		
		Если СтрНайти(ВРег(СтрокаПодключения), ".TXT") > 0 Тогда
			
			Префикс = "TXT";
			
		ИначеЕсли СтрНайти(ВРег(СтрокаПодключения), ".XLS") > 0 Тогда
			
			Префикс = "XLS";
			
		ИначеЕсли СтрНайти(ВРег(СтрокаПодключения), ".DBF") > 0 Тогда
			
			Префикс = "DBF";
		КонецЕсли;
	Иначе
		Префикс = "ADO";
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПолноеИмяФайла     = "Прайс-лист_" + Префикс + ".xml";
	Диалог.Расширение         = "xml";
	Диалог.Фильтр             = "Файлы XML (*.xml)|*.xml";
	
	Если Диалог.Выбрать() И ЗначениеЗаполнено(Диалог.ПолноеИмяФайла) Тогда
		
		СохранитьНастройкиВФайлНаСервере(Диалог.ПолноеИмяФайла);
	Иначе
		ВывестиСообщение(НСтр("ru = 'Не указано имя файла для сохранения настроек.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Кнопка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр             = "Файлы XML (*.xml)|*.xml";
	
	Если Диалог.Выбрать() И ЗначениеЗаполнено(Диалог.ПолноеИмяФайла) Тогда 
		
		ЗагрузитьНастройкиИзФайла(Диалог.ПолноеИмяФайла);
		ФайлИсточникДанныхПриИзменении(Элементы.ФайлИсточникДанных);
	Иначе
		ВывестиСообщение(НСтр("ru = 'Не указано имя файла с сохраненными настройками.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Устанавливает видимость элементов формы
&НаСервере
Процедура УстановитьВидимость()
	
	КолонкиТЗ = Элементы.СтруктураФайлаПрайсЛиста.ПодчиненныеЭлементы;
	
	Элементы.СтрокаПодключения.Заголовок = ?(ФайлИсточникДанных, НСтр("ru = 'Путь к файлу'"), "Подключение");
	Элементы.СтрокаПодключения.Подсказка = ?(ФайлИсточникДанных, НСтр("ru = 'Путь к файлу'"), НСтр("ru = 'Строка подключения'"));
	
	Если ФайлИсточникДанных Тогда
		
		Если СтрНайти(ВРег(СтрокаПодключения), ".DBF") > 0 Тогда
			
			// Перезаполняем список выбора кодовых страниц.
			Элементы.КодоваяСтраница.Доступность = Истина;
			Элементы.КодоваяСтраница.СписокВыбора.Очистить();
			Для каждого ТекКодировка Из ДоступныеКодировки Цикл
				Если ТекКодировка.Пометка Тогда
					
					// Отбираем только помеченные - windows и dos.
					Элементы.КодоваяСтраница.СписокВыбора.Добавить(ТекКодировка.Значение, ТекКодировка.Представление);
				КонецЕсли;
			КонецЦикла;
			
			Элементы.Разделитель.Видимость  = Ложь;
			Элементы.СтрокаНачало.Видимость = Ложь;
			Элементы.СтрокаКонец.Видимость  = Ложь;
			Элементы.ИмяТаблицы.Видимость   = Ложь;
			
			// Видимость колонок СтруктураФайлаПрайсЛиста.
			КолонкиТЗ.СтруктураФайлаПрайсЛистаТипПоля.Видимость      = Истина;
			КолонкиТЗ.СтруктураФайлаПрайсЛистаДлинаПоля.Видимость    = Истина;
			КолонкиТЗ.СтруктураФайлаПрайсЛистаТочностьПоля.Видимость = Истина;
			КолонкиТЗ.СтруктураФайлаПрайсЛистаИмяПоляФайла.Видимость = Истина;
			КолонкиТЗ.СтруктураФайлаПрайсЛистаНомерСтроки.Видимость  = Ложь;
			
			// Заполним по умолчанию колонки.
			Для Каждого ТекСтрока Из СтруктураФайлаПрайсЛиста Цикл
				
				СтрокиПоиска = ПараметрыПолейДБФ.НайтиСтроки(Новый Структура("Имя", ТекСтрока.ИмяРеквизитаПрайсЛиста));
				Если СтрокиПоиска.Количество() > 0 Тогда
					
					СтрокаПоиска = СтрокиПоиска[0];
					
					ТекСтрока.ТипПоля      = СтрокаПоиска.Тип;
					ТекСтрока.ДлинаПоля    = СтрокаПоиска.Длина;
					ТекСтрока.ТочностьПоля = СтрокаПоиска.Точность;
					ТекСтрока.ИмяПоляФайла = СтрокаПоиска.ИмяДБФ;
				КонецЕсли;
			КонецЦикла;
		Иначе
			
			Если СтрНайти(ВРег(СтрокаПодключения), ".XLS") > 0 Тогда
				
				Элементы.Разделитель.Видимость       = Ложь;
				Элементы.КодоваяСтраница.Доступность = Ложь;
			Иначе
				
				// Файл *.TXT
				Разделитель = "#";
				Элементы.Разделитель.Видимость       = Истина;
				Элементы.КодоваяСтраница.Доступность = Истина;
				
				// Перезаполняем список выбора кодовых страниц.
				Элементы.КодоваяСтраница.СписокВыбора.Очистить();
				Для каждого ТекКодировка Из ДоступныеКодировки Цикл
					
					Элементы.КодоваяСтраница.СписокВыбора.Добавить(ТекКодировка.Значение, ТекКодировка.Представление);
				КонецЦикла;
				
			КонецЕсли;
			
			Элементы.СтрокаНачало.Видимость = Истина;
			Элементы.СтрокаКонец.Видимость  = Истина;
			Элементы.ИмяТаблицы.Видимость = Ложь;
			
			// Видимость колонок СтруктураФайлаПрайсЛиста.
			КолонкиТЗ.СтруктураФайлаПрайсЛистаТипПоля.Видимость      = Ложь;
			КолонкиТЗ.СтруктураФайлаПрайсЛистаДлинаПоля.Видимость    = Ложь;
			КолонкиТЗ.СтруктураФайлаПрайсЛистаТочностьПоля.Видимость = Ложь;
			КолонкиТЗ.СтруктураФайлаПрайсЛистаИмяПоляФайла.Видимость = Ложь;
			КолонкиТЗ.СтруктураФайлаПрайсЛистаНомерСтроки.Видимость  = Истина;
			
			КопияСтруктураФайлаПрайсЛиста = СтруктураФайлаПрайсЛиста.Выгрузить();
			КопияСтруктураФайлаПрайсЛиста.Сортировать("НомерСтроки ВОЗР");
			
			мНеВостребуемыхЧисел = Новый Массив;
			ПревНомер = 0;
			
			Для Каждого ТекСтрока Из КопияСтруктураФайлаПрайсЛиста Цикл
				
				Если ТекСтрока.НомерСтроки = 0 Тогда 
					Продолжить; 
				КонецЕсли;
				
				Для СвободныйДиапазон = ПревНомер + 1 По ТекСтрока.НомерСтроки - 1 Цикл
					мНеВостребуемыхЧисел.Добавить(СвободныйДиапазон);
				КонецЦикла;
				
				ПревНомер = ТекСтрока.НомерСтроки;
			КонецЦикла;
			
			ПревНомер = ПревНомер + 1;
			
			// Заполним колонки по умолчанию.
			Для Каждого ТекСтрока Из СтруктураФайлаПрайсЛиста Цикл
				
				Если ТекСтрока.НомерСтроки = 0 Тогда
					
					Если мНеВостребуемыхЧисел.Количество() = 0 Тогда
						
						ТекСтрока.НомерСтроки = ПревНомер;
						ПревНомер = ПревНомер + 1;
					Иначе
						ТекСтрока.НомерСтроки = мНеВостребуемыхЧисел[0];
						мНеВостребуемыхЧисел.Удалить(0);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		
		Элементы.КодоваяСтраница.Доступность = Ложь;
		
		Элементы.Разделитель.Видимость  = Ложь;
		Элементы.СтрокаНачало.Видимость = Ложь;
		Элементы.СтрокаКонец.Видимость  = Ложь;
		Элементы.ИмяТаблицы.Видимость   = Истина;
		
		// Видимость колонок СтруктураФайлаПрайсЛиста.
		КолонкиТЗ.СтруктураФайлаПрайсЛистаТипПоля.Видимость      = Истина;
		КолонкиТЗ.СтруктураФайлаПрайсЛистаДлинаПоля.Видимость    = Истина;
		КолонкиТЗ.СтруктураФайлаПрайсЛистаТочностьПоля.Видимость = Истина;
		КолонкиТЗ.СтруктураФайлаПрайсЛистаИмяПоляФайла.Видимость = Истина;
		КолонкиТЗ.СтруктураФайлаПрайсЛистаНомерСтроки.Видимость  = Ложь;
		
		Для Каждого ТекСтрока Из СтруктураФайлаПрайсЛиста Цикл
			
			ТекСтрока.ТипПоля      = "";
			ТекСтрока.ДлинаПоля    = 0;
			ТекСтрока.ТочностьПоля = 0;
			ТекСтрока.ИмяПоляФайла = "";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Вызываем общий обработчик действия.
	УправлениеДиалогомСправочникаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	// Только просмотр
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СтруктураФайлаПрайсЛистаТочностьПоля.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтруктураФайлаПрайсЛиста.ТипПоля");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "N";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Только просмотр
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СтруктураФайлаПрайсЛистаДлинаПоля.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтруктураФайлаПрайсЛиста.ТипПоля");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ПравоеЗначение = Новый СписокЗначений;
	ПравоеЗначение.Добавить("C");
	ПравоеЗначение.Добавить("N");
	ОтборЭлемента.ПравоеЗначение = ПравоеЗначение;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Заполнение списка выбора таблицами источника данных
&НаСервере
Процедура ЗаполнитьСпискиВыбораТаблиц()
	
	// Загрузим таблицы внешнего источника
	Если ФайлИсточникДанных Тогда
		
		// Ну а тут пока непонятно как получить колонки.
	Иначе
		
		// Лезем в АДО.
		Попытка
			Catalog = Новый COMОбъект("ADOX.Catalog");
			Catalog.ActiveConnection = СтрокаПодключения;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ВывестиСообщение(ОписаниеОшибки);
			Возврат;
		КонецПопытки;
		
		СписокВыбора = Элементы.ИмяТаблицы.СписокВыбора;
		СписокВыбора.Очистить();
		
		Если Catalog.Tables.Count = 0 Тогда
			
			ВывестиСообщение(НСтр("ru = 'В базе данных нет таблиц, заполнение прервано.'"), ЭтотОбъект, Элементы.СтрокаПодключения);
		КонецЕсли; 
		
		// Заполняем таблицы
		Для НомерТаблицы = 0 По Catalog.Tables.Count - 1 Цикл
			
			Table = Catalog.Tables.Item(НомерТаблицы);
			Если ВРег(Table.Type) = "TABLE" Тогда
				
				ИмяТаблицы = Table.Name;
				Если СтрНайти(ИмяТаблицы, " ") = 0 Тогда
					
					СписокВыбора.Добавить(ИмяТаблицы);
				Иначе
					СписокВыбора.Добавить("[" + ИмяТаблицы + "]");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСпискиВыбораТаблиц()

// Заполняет поля для выгрузки прайс-листа.
&НаКлиенте
Процедура ЗаполнитьПоляВыгрузки()
	
	ЭлементИмяПоляФайла = Элементы.СтруктураФайлаПрайсЛиста.ПодчиненныеЭлементы.СтруктураФайлаПрайсЛистаИмяПоляФайла;
	
	// Загрузим поля внешнего источника
	Если ФайлИсточникДанных Тогда
		
		// Ну а тут пока непонятно как получить колонки
		ЭлементИмяПоляФайла.КнопкаВыпадающегоСписка  = Ложь;
		ЭлементИмяПоляФайла.РежимВыбораИзСписка      = Ложь;
		
	Иначе
		
		Если Элементы.ИмяТаблицы.СписокВыбора.Количество() = 0 Тогда
		
			ВывестиСообщение(НСтр("ru = 'В базе данных не обнаружены таблицы типа «TABLE».'"));
			
			ЭлементИмяПоляФайла.СписокВыбора.Очистить();
			
			ЭлементИмяПоляФайла.КнопкаВыпадающегоСписка  = Ложь;
			ЭлементИмяПоляФайла.РежимВыбораИзСписка      = Ложь;
			
			Возврат;
			
		ИначеЕсли ПустаяСтрока(ИмяТаблицы) Тогда
			
			ВывестиСообщение(НСтр("ru = 'Не задано имя таблицы.'"));
			
			ЭлементИмяПоляФайла.СписокВыбора.Очистить();
			
			ЭлементИмяПоляФайла.КнопкаВыпадающегоСписка  = Ложь;
			ЭлементИмяПоляФайла.РежимВыбораИзСписка      = Ложь;
			
			Возврат;
		КонецЕсли;
		
		// Лезем в АДО.
		Состояние(НСтр("ru = 'Инициализация ADODB.Connection ...'"));
		
		Попытка
			
			Приложение = Новый COMОбъект("ADODB.Connection");
			Коннект    = Приложение.Open(СтрокаПодключения);
		Исключение
			
			ПоказатьПредупреждение(,ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		Команда          = Новый COMОбъект("ADODB.Command");
		РезультатЗапроса = Новый COMОбъект("ADODB.Recordset");
		
		РезультатЗапроса.ActiveConnection = Приложение;
		
		ТекстЗапроса = "
		|SELECT TOP 1 " + СокрЛП(ИмяТаблицы) + ".*
		|FROM " + СокрЛП(ИмяТаблицы);
		
		Команда.CommandText      = ТекстЗапроса;
		Команда.ActiveConnection = Приложение;
		
		Попытка
			РезультатЗапроса = Команда.Execute();
		Исключение
			ПоказатьПредупреждение(,ОписаниеОшибки()); 
			Возврат;
		КонецПопытки;
		
		СписокВыбора = ЭлементИмяПоляФайла.СписокВыбора;
		СписокВыбора.Очистить();
		
		ЭлементИмяПоляФайла.КнопкаВыпадающегоСписка  = Истина;
		ЭлементИмяПоляФайла.РежимВыбораИзСписка      = Истина;
		
		// А эти данные - будем выбирать из списка.
		КолПолей = РезультатЗапроса.Fields.Count;
		Для К = 0 По КолПолей - 1 Цикл
			
			ПараметрыПоля  = РезультатЗапроса.Fields(К);
			ИмяКолонки = ПараметрыПоля.Name;
			
			СписокВыбора.Добавить(ИмяКолонки);
			
			ТекСтрока = ПараметрыПолейАДО.Добавить();
			ТекСтрока.Имя          = ПараметрыПоля.Name;
			
			Если ПараметрыПоля.Type = 202 Тогда
				
				ТекСтрока.Тип      = "C";
				ТекСтрока.Длина    = ПараметрыПоля.DefinedSize;
				ТекСтрока.Точность = 0;
				
			ИначеЕсли ПараметрыПоля.Type >= 2 И ПараметрыПоля.Type <= 5 Тогда
				
				ТекСтрока.Тип      = "N";
				ТекСтрока.Длина    = ПараметрыПоля.DefinedSize;
				ТекСтрока.Точность = ПараметрыПоля.Precision;
				
			ИначеЕсли ПараметрыПоля.Type = 7 Тогда
				
				ТекСтрока.Тип      = "D";
				ТекСтрока.Длина    = 0;
				ТекСтрока.Точность = 0;
				
			ИначеЕсли ПараметрыПоля.Type = 11 Тогда
				
				ТекСтрока.Тип      = "B";
				ТекСтрока.Длина    = 0;
				ТекСтрока.Точность = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоляВыгрузки()

// Выбор файла для выгрузки прайс-листа
&НаКлиенте
Процедура ВыборФайла()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.Заголовок               = НСтр("ru = 'Выберите файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ИндексФильтра           = 0;
	ДиалогВыбораФайла.Фильтр                  = "MS Excel (*.xls,*.xlsx)|*.xls;*.xlsx|Текстовый файл (*.txt)|*.txt|DBF 4 (DBASE IV) (*.dbf)|*.dbf";
	
	Файл = Новый Файл(СтрокаПодключения);
	Если Файл.Существует() Тогда
		ДиалогВыбораФайла.ПолноеИмяФайла = СтрокаПодключения;
	КонецЕсли;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		СтрокаПодключения = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры // ВыборФайла()

&НаКлиенте
Процедура УстановитьСнятьПометки(Команда)
	
	Использование = СтрНайти(Команда.Имя, "Установить") > 0;
	
	Для Каждого ТекСтрока Из СтруктураФайлаПрайсЛиста Цикл
		ТекСтрока.Использование = Использование;
	КонецЦикла;
	
КонецПроцедуры

// Процедура разбора строки символов на массив символов
//
// Параметры:
// СтрокаДляРазбора - Строка - Строка для разбора.
//
// Возвращаемое значение:
// Массив - Массив символов строки.
//
&НаСервере
Функция РазобратьСтрокуПодключения(Знач СтрокаДляРазбора)
	
	МассивСтрокиПодключения = Новый Массив;
	Разделитель = ";";
	
	Пока СтрДлина(СтрокаДляРазбора) > 0 Цикл
		
		ПозицияРазделителя = СтрНайти(СтрокаДляРазбора, Разделитель);
		Если ПозицияРазделителя = 0 Тогда
			
			ПозицияРазделителя = СтрДлина(СтрокаДляРазбора) + 1;
		КонецЕсли;
		
		СтрокаПараметр   =  Лев(СтрокаДляРазбора, ПозицияРазделителя - 1);
		СтрокаДляРазбора = Сред(СтрокаДляРазбора, ПозицияРазделителя + 1);
		
		МассивСтрокиПодключения.Добавить(СтрокаПараметр);
	КонецЦикла; 
	
	Возврат МассивСтрокиПодключения;
	
КонецФункции // РазобратьСтрокуПодключения()

&НаКлиенте
Функция ЗаписатьEXCEL(ТипФайла) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПолучитьТабличныйДокумент(ТабличныйДокумент);
	
	Попытка
		ТабличныйДокумент.Записать(СокрЛП(СтрокаПодключения), ТипФайлаТабличногоДокумента[СтрЗаменить(ТипФайла, ".", "")]);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ЗаписатьEXCEL()

// функция записи файла прайс-листа в excel
//
// Параметры:
// ТабличныйДокумент - ТабличныйДокумент - Табличный документ для выгрузки в файл.
//
&НаСервере
Процедура ПолучитьТабличныйДокумент(ТабличныйДокумент)
	
	// Получим все необходимые данные для выгрузки.
	ТЗПрайсЛиста = ПолучитьДанныеПрайсЛиста();
	
	КопияСтруктураФайлаПрайсЛиста = СтруктураФайлаПрайсЛиста.Выгрузить();
	
	мНеВостребуемыхЧисел = Новый Массив;
	КопияСтруктураФайлаПрайсЛиста.Сортировать("НомерСтроки ВОЗР");
	ПревНомер = 0;
	Для Каждого ТекСтрока Из КопияСтруктураФайлаПрайсЛиста Цикл
		
		Если ТекСтрока.НомерСтроки = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		Для СвободныйДиапазон = ПревНомер + 1 По ТекСтрока.НомерСтроки - 1 Цикл
			
			мНеВостребуемыхЧисел.Добавить(СвободныйДиапазон);
		КонецЦикла;
		
		ПревНомер = ТекСтрока.НомерСтроки;
	КонецЦикла;
	
	ПревНомер = ПревНомер + 1;
	
	// Заполним колонки по умолчанию.
	Для Каждого ТекСтрока Из СтруктураФайлаПрайсЛиста Цикл
		
		Если ТекСтрока.НомерСтроки = 0 Тогда
			
			Если мНеВостребуемыхЧисел.Количество() = 0 Тогда
				
				ТекСтрока.НомерСтроки = ПревНомер;
				ПревНомер = ПревНомер + 1;
			Иначе
				ТекСтрока.НомерСтроки = мНеВостребуемыхЧисел[0];
				мНеВостребуемыхЧисел.Удалить(0);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	КопияСтруктураФайлаПрайсЛиста.Очистить();
	Для Каждого ТекСтрока Из СтруктураФайлаПрайсЛиста Цикл
		
		Если НЕ ТекСтрока.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = КопияСтруктураФайлаПрайсЛиста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		Если ТекСтрока.ИмяРеквизитаПрайсЛиста = "Наименование" ИЛИ ТекСтрока.ИмяРеквизитаПрайсЛиста = "ХарактеристикаНоменклатуры" Тогда
			
			ТабличныйДокумент.Область("R1C"+ТекСтрока.НомерСтроки).ШиринаКолонки = 50;
		КонецЕсли;
	КонецЦикла;
	
	ОбрабатываемаяСтрока = ?(НЕ ЗначениеЗаполнено(СтрокаНачало), 1, СтрокаНачало);
	ТекСтрока = -1;
	
	Пока ТекСтрока <= ТЗПрайсЛиста.Количество() - 1 И (СтрокаКонец = 0 ИЛИ ОбрабатываемаяСтрока <= СтрокаКонец) Цикл
		
		Если ТекСтрока <> -1 Тогда
			СтрокаПрайсЛиста = ТЗПрайсЛиста[ТекСтрока];
		КонецЕсли;
		
		Для каждого ПолеВыгрузки Из КопияСтруктураФайлаПрайсЛиста Цикл
			
			ЗначениеПоля = ?(ТекСтрока = -1, ПолеВыгрузки.ИмяРеквизитаПрайсЛиста, СтрокаПрайсЛиста[ПолеВыгрузки.ИмяРеквизитаПрайсЛиста]);
			
			// Для строк, представленных в виде числа добавим неразрывный пробел.
			Если ТипЗнч(ЗначениеПоля) = Тип("Строка") Тогда
				
				СтрокаПоиска = ЗначениеПоля;
				Цифры        = "0123456789";
				
				Пока СтрНайти(Цифры, Лев(СтрокаПоиска,1))>1 Цикл
					СтрокаПоиска = Сред(СтрокаПоиска, 2);
				КонецЦикла;
				
				Если СтрокаПоиска = "" Тогда
					ЗначениеПоля = Символы.НПП + ЗначениеПоля;
				КонецЕсли; 
			КонецЕсли;
			
			ТабличныйДокумент.Область("R"+Формат(ОбрабатываемаяСтрока,"ЧГ=")+"C"+Формат(ПолеВыгрузки.НомерСтроки,"ЧГ=")).Текст = ЗначениеПоля;
		КонецЦикла;
		
		ОбрабатываемаяСтрока = ОбрабатываемаяСтрока + 1;
		ТекСтрока            = ТекСтрока + 1;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьТабличныйДокумент()

// функция записи файла прайс-листа в текстовый файл
//
// Параметры:
// ТЗПрайсЛиста - ТаблицаЗначений - Таблица значений прайс-листа.
//
&НаСервере
Функция ЗаписатьTXT() Экспорт
	
	// Получим все необходимые данные для выгрузки.
	ТЗПрайсЛиста = ПолучитьДанныеПрайсЛиста();
	
	ВсеОК = Истина;
	
	ИмяОбрФайла = СокрЛП(СтрокаПодключения);
	
	// Проверим наличие файла
	Попытка
		Файл = Новый Файл(ИмяОбрФайла);
	Исключение
		ВывестиСообщение(НСтр("ru = 'Невозможно создать файл по заданному адресу.'"));
		Возврат Ложь;
	КонецПопытки;
	
	КопияСтруктураФайлаПрайсЛиста = СтруктураФайлаПрайсЛиста.Выгрузить();
	
	мНеВостребуемыхЧисел = Новый Массив;
	КопияСтруктураФайлаПрайсЛиста.Сортировать("НомерСтроки ВОЗР");
	ПревНомер = 0;
	Для Каждого ТекСтрока Из КопияСтруктураФайлаПрайсЛиста Цикл
		
		Если ТекСтрока.НомерСтроки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для СвободныйДиапазон = ПревНомер + 1 По ТекСтрока.НомерСтроки - 1 Цикл
			мНеВостребуемыхЧисел.Добавить(СвободныйДиапазон);
		КонецЦикла;
		
		ПревНомер = ТекСтрока.НомерСтроки;
	КонецЦикла;
	
	ПревНомер = ПревНомер + 1;
	// Заполним по умолчанию колонки
	Для Каждого ТекСтрока Из СтруктураФайлаПрайсЛиста Цикл
		
		Если ТекСтрока.НомерСтроки = 0 Тогда
			
			Если мНеВостребуемыхЧисел.Количество() =  0 Тогда
				
				ТекСтрока.НомерСтроки = ПревНомер;
				ПревНомер = ПревНомер + 1;
			Иначе
				ТекСтрока.НомерСтроки = мНеВостребуемыхЧисел[0];
				мНеВостребуемыхЧисел.Удалить(0);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	КопияСтруктураФайлаПрайсЛиста.Очистить();
	
	Для Каждого ТекСтрока Из СтруктураФайлаПрайсЛиста Цикл
		
		Если НЕ ТекСтрока.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = КопияСтруктураФайлаПрайсЛиста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
	КопияСтруктураФайлаПрайсЛиста.Сортировать("НомерСтроки Возр");
	
	Попытка
		ФайлОбменаОбъект = Новый ЗаписьТекста(ИмяОбрФайла, КодоваяСтраница);
	Исключение
		ВывестиСообщение(НСтр("ru = 'Ошибка записи файла. Возможно файл открыт пользователем.'"));
		Возврат Ложь;
	КонецПопытки;
	
	ОбрабатываемаяСтрока = ?(НЕ ЗначениеЗаполнено(СтрокаНачало), 1, СтрокаНачало);
	Максимум             = КопияСтруктураФайлаПрайсЛиста.Количество();
	ТекСтрока            = -1;
	Пока ТекСтрока <= ТЗПрайсЛиста.Количество() - 1 И (СтрокаКонец = 0 ИЛИ ОбрабатываемаяСтрока <= СтрокаКонец) Цикл
		
		Если ТекСтрока <> -1 Тогда
			СтрокаПрайсЛиста = ТЗПрайсЛиста[ТекСтрока];
		КонецЕсли;
		
		НоваяСтрокаФайла = "";
		Инд = 1;
		Для Каждого ПолеВыгрузки Из КопияСтруктураФайлаПрайсЛиста Цикл
			
			ЗначениеПоля = ?(ТекСтрока = -1, ПолеВыгрузки.ИмяРеквизитаПрайсЛиста, СтрокаПрайсЛиста[ПолеВыгрузки.ИмяРеквизитаПрайсЛиста]);
			
			Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
				ЗначениеПоля = Формат(ЗначениеПоля, "ЧН=0; ЧГ=");
			КонецЕсли;
			
			Если Инд = Максимум Тогда
				ТекРазделитель = "";
			Иначе
				ТекРазделитель = Разделитель;
			КонецЕсли;
			
			НоваяСтрокаФайла = НоваяСтрокаФайла + ЗначениеПоля + ТекРазделитель;
			Инд = Инд + 1;
		КонецЦикла; 
		
		ФайлОбменаОбъект.ЗаписатьСтроку(НоваяСтрокаФайла);
		ОбрабатываемаяСтрока = ОбрабатываемаяСтрока + 1;
		ТекСтрока            = ТекСтрока + 1;
	КонецЦикла;
	
	ФайлОбменаОбъект.Закрыть();
	
	Возврат ВсеОК;
	
КонецФункции // ПрочитатьTXT()

// функция записи файла прайс-листа в формат dBase
//
// Параметры:
// ТЗПрайсЛиста - ТаблицаЗначений - Таблица значений прайс-листа.
//
&НаСервере
Функция ЗаписатьDBF() Экспорт
	
	// Получим все необходимые данные для выгрузки.
	ТЗПрайсЛиста = ПолучитьДанныеПрайсЛиста();
	
	ВсеОК = Истина;
	
	КопияСтруктураФайлаПрайсЛиста = СтруктураФайлаПрайсЛиста.Выгрузить();
	КопияСтруктураФайлаПрайсЛиста.Очистить();
	
	// Проверим корректность колонок.
	Для Каждого ПолеВыгрузки Из СтруктураФайлаПрайсЛиста Цикл
		
		Если НЕ ПолеВыгрузки.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		// Тип поля должен быть заполнен.
		Колонка_ТипПоля   = ПолеВыгрузки.ТипПоля;
		Колонка_ДлинаПоля = ПолеВыгрузки.ДлинаПоля;
		
		Если НЕ ЗначениеЗаполнено(Колонка_ТипПоля) ИЛИ НЕ ЗначениеЗаполнено(ПолеВыгрузки.ИмяПоляФайла) Тогда
			
			ВывестиСообщение(НСтр("ru = 'В поле таблицы для реквизита «%1» заданы неверные данные.'"), , , , , ПолеВыгрузки.ИмяРеквизитаПрайсЛиста);
			Возврат Ложь;
		Иначе
			
			// Если Строка или Число - указана длина поля.
			Если Колонка_ТипПоля = "N" ИЛИ Колонка_ТипПоля = "C" Тогда
				
				Если НЕ ЗначениеЗаполнено(Колонка_ДлинаПоля) Тогда
					
					ВывестиСообщение(НСтр("ru = 'В поле таблицы для реквизита «%1» заданы неверные данные.'"), , , , , ПолеВыгрузки.ИмяРеквизитаПрайсЛиста);
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = КопияСтруктураФайлаПрайсЛиста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПолеВыгрузки);
	КонецЦикла;
	
	ДБФ = Новый XBase;
	
	// Создаем новый ДБФ-файл
	Для Каждого ПолеВыгрузки Из КопияСтруктураФайлаПрайсЛиста Цикл
		
		Тип      = ПолеВыгрузки.ТипПоля;
		Длина    = Строка(?(ПолеВыгрузки.ДлинаПоля    = 0, "", ПолеВыгрузки.ДлинаПоля));
		Точность = Строка(?(ПолеВыгрузки.ТочностьПоля = 0, "", ПолеВыгрузки.ТочностьПоля));
		
		ДБФ.Поля.Добавить(ПолеВыгрузки.ИмяПоляФайла, Тип, Длина, Точность);
	КонецЦикла;
	
	// Если 1251 - делаем кодировку Windows для DBF.
	Если КодоваяСтраница = "windows-1251" Тогда
		ДБФ.Кодировка = КодировкаXBase.ANSI;
	Иначе
		// Иначе считаем, что DOS.
		ДБФ.Кодировка = КодировкаXBase.OEM;
	КонецЕсли;
	
	Попытка
		ДБФ.СоздатьФайл(СтрокаПодключения);
	Исключение
		ВывестиСообщение(НСтр("ru = 'Ошибка записи файла. Возможно файл открыт пользователем.'"));
		Возврат Ложь;
	КонецПопытки;
	
	Для Каждого СтрокаПрайсЛиста Из ТЗПрайсЛиста Цикл
		
		// Добавление новой записи.
		ДБФ.Добавить();
		Для Каждого ПолеВыгрузки Из КопияСтруктураФайлаПрайсЛиста Цикл
			
			ДБФ[ПолеВыгрузки.ИмяПоляФайла] = СтрокаПрайсЛиста[ПолеВыгрузки.ИмяРеквизитаПрайсЛиста];
		КонецЦикла;
		
		ДБФ.Записать();
	КонецЦикла;
	
	ДБФ.ЗакрытьФайл();
	
	Возврат ВсеОК;
	
КонецФункции // ЗаписатьDBF()

// функция записи файла прайс-листа через ADO
//
// Параметры:
// ТЗПрайсЛиста - ТаблицаЗначений - Таблица значений прайс-листа.
//
&НаСервере
Функция ЗаписатьADO() Экспорт
	
	// Получим все необходимые данные для выгрузки.
	ТЗПрайсЛиста = ПолучитьДанныеПрайсЛиста();
	
	ВсеОК = Истина;
	
	КопияСтруктураФайлаПрайсЛиста = СтруктураФайлаПрайсЛиста.Выгрузить();
	КопияСтруктураФайлаПрайсЛиста.Очистить();
	
	// Проверим корректность колонок.
	Для Каждого ПолеВыгрузки Из СтруктураФайлаПрайсЛиста Цикл
		
		Если НЕ ПолеВыгрузки.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		// Тип поля должен быть заполнен.
		Колонка_ТипПоля   = ПолеВыгрузки.ТипПоля;
		Колонка_ДлинаПоля = ПолеВыгрузки.ДлинаПоля;
		
		Если НЕ ЗначениеЗаполнено(Колонка_ТипПоля) ИЛИ НЕ ЗначениеЗаполнено(ПолеВыгрузки.ИмяПоляФайла) Тогда
			
			ВывестиСообщение(НСтр("ru = 'В поле таблицы для реквизита «%1» заданы неверные данные.'"), , , , , ПолеВыгрузки.ИмяРеквизитаПрайсЛиста);
			Возврат Ложь;
		Иначе
			// если Строка или Число - указана длина поля
			Если Колонка_ТипПоля = "N" ИЛИ Колонка_ТипПоля = "C" Тогда
				
				Если НЕ ЗначениеЗаполнено(Колонка_ДлинаПоля) Тогда
					
					ВывестиСообщение(НСтр("ru = 'В поле таблицы для реквизита «%1» заданы неверные данные.'"), , , , , ПолеВыгрузки.ИмяРеквизитаПрайсЛиста);
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = КопияСтруктураФайлаПрайсЛиста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПолеВыгрузки);
	КонецЦикла;
	
	// Создание таблицы
	// Начальная инициализация
	Catalog = Новый COMОбъект("ADOX.Catalog");
	
	Попытка
		Catalog.ActiveConnection = СтрокаПодключения;
	Исключение
		ИмяБД       = "";
		ЕстьИмяБД   = Ложь;
		МассивСтрок = РазобратьСтрокуПодключения(СтрокаПодключения);
		
		Для Инд = 0 По МассивСтрок.ВГраница() Цикл
			
			ЗначениеСтроки = МассивСтрок[Инд];
			Если СтрНайти(ЗначениеСтроки, "Data Source=") > 0 Тогда
				
				ЗначениеСтроки = СтрЗаменить(ЗначениеСтроки, "Data Source=", "");
				ИмяБД = ЗначениеСтроки;
			КонецЕсли;
		КонецЦикла;
		
		ВывестиСообщение(НСтр("ru = 'Ошибка подключения через ADO к базе данных «%1».
		|Возможно файл БД не существует или поврежден.'"), , , , , СокрЛП(ИмяБД));
		Возврат Ложь;
	КонецПопытки;
	
	// Проверка на существование таблицы.
	ЕстьТаблица = Ложь;
	Для НомерТаблицы = 0 По Catalog.Tables.Count - 1 Цикл
		
		Если Catalog.Tables.Item(НомерТаблицы).Type = "TABLE" Тогда
			
			ИмяТаблицыАДО = Catalog.Tables.Item(НомерТаблицы).Name;
			
			Если ИмяТаблицыАДО = СокрЛП(ИмяТаблицы) Тогда
				
				ЕстьТаблица = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьТаблица Тогда
		
		// Создание новой таблицы.
		Table = Новый COMОбъект("ADOX.Table");
		
		// Имя таблицы.
		Table.Name = СокрЛП(ИмяТаблицы);
		
		Для Каждого ПолеВыгрузки Из КопияСтруктураФайлаПрайсЛиста Цикл
			
			// Создание новой колонки.
			Column = Новый COMОбъект("ADOX.Column");
			
			// Имя колонки.
			Column.Name = ПолеВыгрузки.ИмяПоляФайла;
			
			// Тип данных колонки.
			Если ПолеВыгрузки.ТипПоля = "C" Тогда
				
				Column.Type         = 202; // adVarWChar
				Column.DefinedSize  = ПолеВыгрузки.ДлинаПоля; 
				Column.NumericScale = ПолеВыгрузки.ДлинаПоля;
				
			ИначеЕсли ПолеВыгрузки.ТипПоля = "N" Тогда
				
				Column.Type        = 5; // adDouble
				Column.DefinedSize = ПолеВыгрузки.ДлинаПоля;
				Column.Precision   = ПолеВыгрузки.ТочностьПоля;
				
			ИначеЕсли ПолеВыгрузки.ТипПоля = "D" Тогда
				
				Column.Type = 7; // adDate
				
			ИначеЕсли ПолеВыгрузки.ТипПоля = "B" Тогда
				
				Column.Type = 11; // adBoolean
			КонецЕсли;
			
			// Присоединение колонки к таблице.
			Table.Columns.Append(Column);
			Column = Неопределено;
		КонецЦикла;
		
		// Присоединение созданной таблицы
		Catalog.Tables.Append(Table);
	КонецЕсли;
	
	// Добавление данных запросом.
	// Создание объекта установки связи с источником данных.
	Connection = Новый COMОбъект("ADODB.Connection");
	
	// Подключение к источнику данных.
	Попытка
		Connection.Open(СтрокаПодключения);
	Исключение
		ВывестиСообщение(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	// Создание объекта выполнения команды.
	Command = Новый COMОбъект("ADODB.Command");
	
	// Указание активного соединения.
	Command.ActiveConnection = Connection;
	
	// Создание объекта набора записей
	Recordset = Новый COMОбъект("ADODB.Recordset");
	Recordset.Open("Select * from " + СокрЛП(ИмяТаблицы), Connection, 1, 3);
	
	Для Каждого СтрокаПрайсЛиста Из ТЗПрайсЛиста Цикл
		
		// Добавление новой записи.
		Recordset.AddNew();
		Для Каждого ПолеВыгрузки Из КопияСтруктураФайлаПрайсЛиста Цикл
			
			Попытка
				Recordset.Fields(ПолеВыгрузки.ИмяПоляФайла).Value = СтрокаПрайсЛиста[ПолеВыгрузки.ИмяРеквизитаПрайсЛиста];
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ВывестиСообщение(НСтр("ru = 'В поле таблицы для реквизита «%1» заданы неверные данные.'"), , , , , ПолеВыгрузки.ИмяРеквизитаПрайсЛиста);
				
				Возврат Ложь;
			КонецПопытки;
		КонецЦикла;
		
		// Обновление изменений.
		Recordset.UpDate();
	КонецЦикла;
	
	// Закрываем соединение
	Connection.Close();
	Command = Неопределено;
	
	Возврат ВсеОК;
	
КонецФункции // ПрочитатьADO()

&НаСервере
Функция ПолучитьДанныеПрайсЛиста()
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПрайсЛист.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ПрайсЛист
	|ИЗ
	|	Справочник.ПрайсЛист КАК ПрайсЛист
	|ГДЕ
	|	НЕ ПрайсЛист.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ ПрайсЛист.Номенклатура.ЭтоГруппа
	|	И НЕ ПрайсЛист.Номенклатура.ПометкаУдаления" + ?(ЗначениеЗаполнено(ВидПрайсЛиста), "
	|	И ПрайсЛист.Владелец = &ВидПрайсЛиста", "") + "
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;";
	
	ЕстьЦена           = СтруктураФайлаПрайсЛиста.НайтиСтроки(Новый Структура("ИмяРеквизитаПрайсЛиста", "Цена"))[0].Использование;
	ЕстьЕдиница        = СтруктураФайлаПрайсЛиста.НайтиСтроки(Новый Структура("ИмяРеквизитаПрайсЛиста", "ЕдиницаИзмерения"))[0].Использование;
	ЕстьХарактеристика = СтруктураФайлаПрайсЛиста.НайтиСтроки(Новый Структура("ИмяРеквизитаПрайсЛиста", "ХарактеристикаНоменклатуры"))[0].Использование;
	
	ТекстВыборки    = "";
	ТекстСоединения = "";
	
	Если ЕстьЦена Тогда
		
		// Для выбранного подразделения получим всех родителей.
		ТаблицаПодразделений = Новый ТаблицаЗначений;
		ТаблицаПодразделений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
		ТаблицаПодразделений.Колонки.Добавить("Уровень",       Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
		
		Уровень     = 0;
		ТекРодитель = ПодразделениеКомпании;
		Пока ЗначениеЗаполнено(ТекРодитель) Цикл
			
			НоваяСтрока = ТаблицаПодразделений.Добавить();
			НоваяСтрока.Подразделение = ТекРодитель;
			НоваяСтрока.Уровень       = Уровень;
			
			ТекРодитель = ТекРодитель.Родитель;
			Уровень     = Уровень + 1;
		КонецЦикла;
		
		НоваяСтрока = ТаблицаПодразделений.Добавить();
		НоваяСтрока.Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
		НоваяСтрока.Уровень       = Уровень;
		
		// Определим базовый тип цен и формулу получения цены из базовой.
		РабочийТипЦен = ТипЦен;
		ШаблонЦена    = "ТаблицаЦен.Цена";
		
		ТекстСоединенийПроцентыСкидкиНаценки = "";
		
		// Если расчетная цена получим базовую цену.
		Счетчик = 1;
		Пока РабочийТипЦен.Рассчитывается Цикл
			
			Если РабочийТипЦен.ПроцентыСкидкиНаценки.Количество() > 0 Тогда
				
				ИмяТаблицы = "ПроцентыСкидкиНаценки" + Строка(Счетчик);
				
				ТекстСоединенийПроцентыСкидкиНаценки = ТекстСоединенийПроцентыСкидкиНаценки + "
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК " + ИмяТаблицы + "
				|ПО
				|	" + ИмяТаблицы + ".Ссылка = &ТипЦены" + Строка(Счетчик) + "
				|	И ТаблицаЦен.Номенклатура.ТипНоменклатуры = " + ИмяТаблицы + ".ТипНоменклатуры";
				
				ШаблонЦена = "(" + ШаблонЦена + "+" + ШаблонЦена + "*ЕСТЬNULL(" + ИмяТаблицы + ".ПроцентСкидкиНаценки/100, " + Формат(РабочийТипЦен.ПроцентСкидкиНаценки / 100, "ЧРД=.; ЧН=0") + "))";
				
				Запрос.УстановитьПараметр("ТипЦены" + Строка(Счетчик), РабочийТипЦен);
				
				Счетчик = Счетчик + 1;
				
			ИначеЕсли РабочийТипЦен.ПроцентСкидкиНаценки <> 0 Тогда
				
				ШаблонЦена = "(" + ШаблонЦена + "+" + ШаблонЦена + "*" + Формат(РабочийТипЦен.ПроцентСкидкиНаценки / 100, "ЧРД=.") + ")";
			КонецЕсли;
			
			РабочийТипЦен = РабочийТипЦен.БазовыйТипЦен;
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаПодразделений.Подразделение КАК Справочник.ПодразделенияКомпании) КАК Подразделение,
		|	ТаблицаПодразделений.Уровень КАК Уровень
		|ПОМЕСТИТЬ ТаблицаПодразделений
		|ИЗ
		|	&ТаблицаПодразделений КАК ТаблицаПодразделений
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦен.Номенклатура КАК Номенклатура" + ?(ЕстьХарактеристика, ",
		|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, ",
		|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения", "") + ",
		|	ТаблицаЦен.Период КАК Период,
		|	ТаблицаПодразделений.Уровень КАК Уровень,
		|	ТаблицаЦен.Цена КАК Цена
		|ПОМЕСТИТЬ
		|	ТаблицаЦен
		|ИЗ
		|	РегистрСведений.Цены КАК ТаблицаЦен
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ТаблицаПодразделений КАК ТаблицаПодразделений
		|ПО 
		|	ТаблицаЦен.ПодразделениеКомпании = ТаблицаПодразделений.Подразделение
		|ГДЕ
		|	ТаблицаЦен.ТипЦен = &ВыбТипЦен
		|	И ТаблицаЦен.Контрагент=&Контрагент
		|	И " + ?(ЕстьХарактеристика, "", "ТаблицаЦен.ХарактеристикаНоменклатуры=ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И ") + "
		|	" + ?(ЕстьЕдиница, "", "ТаблицаЦен.ЕдиницаИзмерения=ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) И ") + "
		|	ТаблицаЦен.Номенклатура В (ВЫБРАТЬ ПрайсЛист.Номенклатура ИЗ ПрайсЛист КАК ПрайсЛист)
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|УНИЧТОЖИТЬ
		|	ТаблицаПодразделений
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦен.Номенклатура КАК Номенклатура" + ?(ЕстьХарактеристика, ",
		|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, ",
		|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения", "") + ",
		|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
		|ПОМЕСТИТЬ
		|	СрезПоследних
		|ИЗ
		|	ТаблицаЦен КАК ТаблицаЦен
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЦен.Номенклатура" + ?(ЕстьХарактеристика, ",
		|	ТаблицаЦен.ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, ",
		|	ТаблицаЦен.ЕдиницаИзмерения", "") + "
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦен.Номенклатура КАК Номенклатура" + ?(ЕстьХарактеристика, ",
		|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, ",
		|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения", "") + ",
		|	ТаблицаЦен.Уровень КАК Уровень,
		|	МАКСИМУМ(ТаблицаЦен.Цена) КАК Цена
		|ПОМЕСТИТЬ
		|	ТаблицаЦенПодразделений
		|ИЗ
		|	СрезПоследних КАК СрезПоследних
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ТаблицаЦен КАК ТаблицаЦен
		|ПО
		|	СрезПоследних.Номенклатура = ТаблицаЦен.Номенклатура" + ?(ЕстьХарактеристика, "
		|	И СрезПоследних.ХарактеристикаНоменклатуры = ТаблицаЦен.ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, "
		|	И СрезПоследних.ЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения", "") + "
		|	И СрезПоследних.Период = ТаблицаЦен.Период
		|ГДЕ
		|	НЕ ТаблицаЦен.Цена = 0
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЦен.Номенклатура" + ?(ЕстьХарактеристика, ",
		|	ТаблицаЦен.ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, ",
		|	ТаблицаЦен.ЕдиницаИзмерения", "") + ",
		|	ТаблицаЦен.Уровень
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|УНИЧТОЖИТЬ
		|	ТаблицаЦен
		|;
		|
		|УНИЧТОЖИТЬ
		|	СрезПоследних
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦен.Номенклатура КАК Номенклатура" + ?(ЕстьХарактеристика, ",
		|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, ",
		|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения", "") + ",
		|	МИНИМУМ(ТаблицаЦен.Уровень) КАК Уровень
		|ПОМЕСТИТЬ
		|	СрезПоследних
		|ИЗ
		|	ТаблицаЦенПодразделений КАК ТаблицаЦен
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЦен.Номенклатура" + ?(ЕстьХарактеристика, ",
		|	ТаблицаЦен.ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, ",
		|	ТаблицаЦен.ЕдиницаИзмерения", "") + "
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦен.Номенклатура КАК Номенклатура" + ?(ЕстьХарактеристика, ",
		|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, ",
		|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения", "") + ",
		|	(" + ШаблонЦена + ")*(КурсыВалютСрезПоследних.Курс/ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1)/&КурсПрайсЛиста) КАК Цена
		|ПОМЕСТИТЬ
		|	ЦеныСрезПоследних
		|ИЗ
		|	СрезПоследних КАК СрезПоследних
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ТаблицаЦенПодразделений КАК ТаблицаЦен
		|ПО 
		|	СрезПоследних.Номенклатура = ТаблицаЦен.Номенклатура" + ?(ЕстьХарактеристика, "
		|	И СрезПоследних.ХарактеристикаНоменклатуры = ТаблицаЦен.ХарактеристикаНоменклатуры", "") + ?(ЕстьЕдиница, "
		|	И СрезПоследних.ЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения", "") + "
		|	И СрезПоследних.Уровень = ТаблицаЦен.Уровень
		|" + ?(ТипЦен.ВВалютеУчета, "ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.КурсыВалют.СрезПоследних() КАК КурсыВалютСрезПоследних
		|ПО
		|	ТаблицаЦен.Номенклатура.ВалютаУчета=КурсыВалютСрезПоследних.Валюта","
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(,Валюта=&ВалютаТипаЦен) КАК КурсыВалютСрезПоследних
		|	ПО ИСТИНА") + " 
		|" + ТекстСоединенийПроцентыСкидкиНаценки + "
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|УНИЧТОЖИТЬ
		|	ТаблицаЦенПодразделений
		|;
		|
		|УНИЧТОЖИТЬ
		|	СрезПоследних
		|;
		|";
		
		Если ВНаличииНаСкладе Тогда
			
			Если РабочийТипЦен.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения И ЕстьЕдиница Тогда
				
				ТекстВыборки = ",
				|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЕСТЬNULL(ЦеныСрезПоследнихОбщая.Цена, 0)) КАК Цена";
				
				ТекстСоединения = "
				|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследних
				|	ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура
				|	И ОстаткиТоваровКомпанииОстатки.Номенклатура.БазоваяЕдиницаИзмерения = ЦеныСрезПоследних.ЕдиницаИзмерения.ЕдиницаПоКлассификатору
				|	И ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент = 1
				|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследнихОбщая
				|	ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследнихОбщая.Номенклатура
				|	И ЦеныСрезПоследнихОбщая.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
				
			ИначеЕсли РабочийТипЦен.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоХарактеристике И ЕстьХарактеристика Тогда
				
				ТекстВыборки = ",
				|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЕСТЬNULL(ЦеныСрезПоследнихОбщая.Цена, 0)) КАК Цена";
				
				ТекстСоединения = "
				|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследних
				|	ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура
				|	И ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры
				|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследнихОбщая
				|	ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследнихОбщая.Номенклатура
				|	И ЦеныСрезПоследнихОбщая.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
			Иначе
				ТекстВыборки = ",
				|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена";
				
				ТекстСоединения = "
				|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследних
				|	ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
			|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Наименование КАК Наименование,
			|	" + ?(ЕстьХарактеристика, "Представление(ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,", "") + "
			|	" + ?(ЕстьЕдиница, "Представление(ОстаткиТоваровКомпанииОстатки.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмерения,", "") + "
			|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК Количество" + ТекстВыборки + "
			|	
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, " + ?(ЗначениеЗаполнено(СкладКомпании), "СкладКомпании=&СкладКомпании И ", "") + "Номенклатура В (ВЫБРАТЬ ПрайсЛист.Номенклатура ИЗ ПрайсЛист КАК ПрайсЛист)) КАК ОстаткиТоваровКомпанииОстатки" + ТекстСоединения;
		Иначе
			Если РабочийТипЦен.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения И ЕстьЕдиница Тогда
				
				ТекстВыборки = ",
				|	Представление(ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, ТаблицаТоваров.ЕдиницаИзмерения)) КАК ЕдиницаИзмерения,
				|	" + ?(ЕстьХарактеристика, "Представление(ТаблицаТоваров.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,", "") + "
				|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЕСТЬNULL(ЦеныСрезПоследнихОбщая.Цена, 0)) КАК Цена";
				
				ТекстСоединения = "
				|ПОЛНОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследних
				|	ПО ТаблицаТоваров.Номенклатура = ЦеныСрезПоследних.Номенклатура
				|	И ТаблицаТоваров.ЕдиницаИзмерения = ЦеныСрезПоследних.ЕдиницаИзмерения.ЕдиницаПоКлассификатору
				|	И ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент=1
				|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследнихОбщая
				|	ПО ТаблицаТоваров.Номенклатура = ЦеныСрезПоследнихОбщая.Номенклатура
				|	И ЦеныСрезПоследнихОбщая.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
				
			ИначеЕсли РабочийТипЦен.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоХарактеристике И ЕстьХарактеристика Тогда
				
				ТекстВыборки = ",
				|	" + ?(ЕстьЕдиница, "Представление(ЕСТЬNULL(ТаблицаТоваров.ЕдиницаИзмерения, ЦеныСрезПоследних.Номенклатура.БазоваяЕдиницаИзмерения)) КАК ЕдиницаИзмерения,", "") + "
				|	Представление(ЕСТЬNULL(ТаблицаТоваров.ХарактеристикаНоменклатуры, ЦеныСрезПоследних.ХарактеристикаНоменклатуры)) КАК ХарактеристикаНоменклатуры,
				|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЕСТЬNULL(ЦеныСрезПоследнихОбщая.Цена, 0)) КАК Цена";
				
				ТекстСоединения = "
				|ПОЛНОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследних
				|	ПО ТаблицаТоваров.Номенклатура = ЦеныСрезПоследних.Номенклатура
				|	И ТаблицаТоваров.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры
				|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследнихОбщая
				|	ПО ТаблицаТоваров.Номенклатура = ЦеныСрезПоследнихОбщая.Номенклатура
				|	И ЦеныСрезПоследнихОбщая.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
			Иначе
				ТекстВыборки = ",
				|	" + ?(ЕстьЕдиница, "Представление(ТаблицаТоваров.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,", "") + "
				|	" + ?(ЕстьХарактеристика, "Представление(ТаблицаТоваров.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,", "") + "
				|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена";
				
				ТекстСоединения = "
				|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследних
				|	ПО ТаблицаТоваров.Номенклатура = ЦеныСрезПоследних.Номенклатура";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ТаблицаТоваров.Артикул, ЦеныСрезПоследних.Номенклатура.Артикул) КАК Артикул,
			|	ЕСТЬNULL(ТаблицаТоваров.Наименование, ЦеныСрезПоследних.Номенклатура.Наименование) КАК Наименование,
			|	ЕСТЬNULL(ТаблицаТоваров.Количество, 0) КАК Количество" + ТекстВыборки + "
			|ИЗ
			|(ВЫБРАТЬ
			|	ПрайсЛист.Номенклатура КАК Номенклатура,
			|	ПрайсЛист.Номенклатура.Артикул КАК Артикул,
			|	ПрайсЛист.Номенклатура.Наименование КАК Наименование,
			|	" + ?(ЕстьЕдиница, "ПрайсЛист.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,", "") + "
			|	" + ?(ЕстьХарактеристика, "ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,", "") + "
			|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК Количество
			|ИЗ
			|	ПрайсЛист КАК ПрайсЛист
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(," + ?(ЗначениеЗаполнено(СкладКомпании), "СкладКомпании=&СкладКомпании", "") + ") КАК ОстаткиТоваровКомпанииОстатки
			|	ПО ПрайсЛист.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура) КАК ТаблицаТоваров" + ТекстСоединения;
		КонецЕсли;
	Иначе
		Если ВНаличииНаСкладе Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
			|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Наименование КАК Наименование,
			|	" + ?(ЕстьХарактеристика, "Представление(ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,", "") + "
			|	" + ?(ЕстьЕдиница, "Представление(ОстаткиТоваровКомпанииОстатки.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмерения,", "") + "
			|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК Количество
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, " + ?(ЗначениеЗаполнено(СкладКомпании), "СкладКомпании=&СкладКомпании И ", "") + "Номенклатура В (ВЫБРАТЬ ПрайсЛист.Номенклатура ИЗ ПрайсЛист КАК ПрайсЛист)) КАК ОстаткиТоваровКомпанииОстатки";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПрайсЛист.Номенклатура.Артикул КАК Артикул,
			|	ПрайсЛист.Номенклатура.Наименование КАК Наименование,
			|	" + ?(ЕстьХарактеристика, "Представление(ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,", "") + "
			|	" + ?(ЕстьЕдиница, "Представление(ПрайсЛист.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмерения,", "") + "
			|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Количество
			|ИЗ
			|	ПрайсЛист КАК ПрайсЛист
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(," + ?(ЗначениеЗаполнено(СкладКомпании), "СкладКомпании=&СкладКомпании", "") + ") КАК ОстаткиТоваровКомпанииОстатки
			|	ПО ПрайсЛист.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура";
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВидПрайсЛиста",        ВидПрайсЛиста);
	Запрос.УстановитьПараметр("ВыбТипЦен",            РабочийТипЦен);
	Запрос.УстановитьПараметр("СкладКомпании",        СкладКомпании);
	Запрос.УстановитьПараметр("Контрагент",           Контрагент);
	Запрос.УстановитьПараметр("ТаблицаПодразделений", ТаблицаПодразделений);
	Запрос.УстановитьПараметр("ВалютаТипаЦен",        ТипЦен.ВалютаЦены);
	
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ТекущаяДатаСеанса());
	КурсПрайсЛиста = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	
	Запрос.УстановитьПараметр("КурсПрайсЛиста", ?(КурсПрайсЛиста = 0, 1, КурсПрайсЛиста));
	
	ТЗПрайсЛиста = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗПрайсЛиста;
	
КонецФункции // ПолучитьДанныеПрайсЛиста()

// Выгружает текущие настройки во внешний файл
&НаСервере
Процедура СохранитьНастройкиВФайлНаСервере(ПолноеИмяФайла) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("НастройкиФормы");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Элементы");
	Для каждого ЭлементФормы Из Элементы Цикл
		
		Если  ТипЗнч(ЭлементФормы) = Тип("ПолеФормы")
			И ТипЗнч(ЭлементФормы.Родитель) <> Тип("ТаблицаФормы") Тогда
			
			ЗаписьXML.ЗаписатьАтрибут(ЭлементФормы.Имя, XMLСтрока(ЭтотОбъект[ЭлементФормы.Имя]));
		КонецЕсли;
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СтруктураФайлаПрайсЛиста");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СтруктураФайлаПрайсЛиста.Выгрузить(), НазначениеТипаXML.Явное);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	ВывестиСообщение(НСтр("ru = 'Сохранение настроек успешно завершено.'"));
	
КонецПроцедуры // СохранитьНастройкиВФайл()

// Загружает настройки из внешнего файла
&НаСервере
Процедура ЗагрузитьНастройкиИзФайла(ПолноеИмяФайла) Экспорт
	
	// Чтение XML
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
	
	Попытка
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
				
				Продолжить;
			Иначе
				
				ИмяЭлементаXML = ЧтениеXML.Имя;
			КонецЕсли;
			
			Если ИмяЭлементаXML = "Элементы" Тогда
				
				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					
					// Файл могли изменить или изменили форму выгрузки.
					Попытка
						
						Если Элементы.Найти(ЧтениеXML.Имя) <> Неопределено Тогда
							
							ЭтотОбъект[ЧтениеXML.Имя] = XMLЗначение(ТипЗнч(ЭтотОбъект[ЧтениеXML.Имя]), ЧтениеXML.Значение);
						КонецЕсли;
						
					Исключение
						
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при чтении файла'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(ПолноеИмяФайла), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						
					КонецПопытки;
					
				КонецЦикла;
			ИначеЕсли ИмяЭлементаXML = "СтруктураФайлаПрайсЛиста" Тогда
				
				ЧтениеXML.Прочитать();
				ПрочитаннаяСтруктураФайлаПрайсЛиста = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("ТаблицаЗначений"));
				Если ТипЗнч(ПрочитаннаяСтруктураФайлаПрайсЛиста) = Тип("ТаблицаЗначений") Тогда
					
					СтруктураФайлаПрайсЛиста.Загрузить(ПрочитаннаяСтруктураФайлаПрайсЛиста);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЧтениеXML.Закрыть();
	Исключение
		
		ВывестиСообщение(НСтр("ru = 'Неправильный формат файла.'"));
		Возврат;
	КонецПопытки;
	
	ВывестиСообщение(НСтр("ru = 'Загрузка настроек успешно завершена.'"));
	
КонецПроцедуры // ЗагрузитьНастройкиИзФайла()

#КонецОбласти
